import math


def area(r):
    '''Возвращает площадь круга с радиусом r.

    Параметры:
        r (int|float): число r - радиус круга.
    
    Возвращаемое значение:
        float: площадь круга.

    Пример вызова:
        >>> area(5)
        78.53981633974483
        >>> area(2.5)
        19.634954084936208
    '''

    return math.pi * r * r


def perimeter(r):
    '''Возвращает длину окружности радиусом r.

    Параметры:
        r (int|float): число r - радиус круга.
    
    Возвращаемое значение:
        float: длина окружности.
    
    Пример вызова:
        >>> perimeter(5)
        31.41592653589793
        >>> perimeter(2.5)
        15.707963267948966
    '''

    return 2 * math.pi * r